flippy-card-api-backend/app/controllers/cards_controller.rb

INSERT INTO "cards" ("english", "foreign", "deck_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["english", "Nihao"], ["foreign", "dsds"], ["deck_id", 1], ["created_at", "2019-08-21 16:03:17.057124"], ["updated_at", "2019-08-21 16:03:17.057124"]]
---
    def create
        @card = Card.create(cards_params)

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]
UPDATE "cards" SET "complete" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["complete", 1], ["updated_at", "2019-08-21 20:40:03.205023"], ["id", 44]]
---
    def update
        card = Card.find(params[:id])
        card.update(cards_params)

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 84], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 84]]
---
    def destroy
        card = Card.find(params[:id])
        card.destroy