flippy-card-api-backend/app/controllers/decks_controller.rb

    def index
        @decks = Deck.all
---
SELECT "decks".* FROM "decks"

    def show
        @deck = Deck.find(params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        deck = Deck.find(params[:id])
        deck.update(deck_params)
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "decks" SET "score" = ?, "updated_at" = ? WHERE "decks"."id" = ?  [["score", 10], ["updated_at", "2019-08-21 01:54:07.680285"], ["id", 1]]